[
  {
    "title": "Minimalist React Portfolio",
    "description": "Built a clean, minimalist developer portfolio focused on accessibility, responsive design, and fast performance. Implemented reusable React components, route-based navigation, and typed props with TypeScript. Added Cypress E2E tests to validate navigation, links, and form interactions.",
    "duration": "Dec 2025",
    "tech": ["React", "TypeScript", "JavaScript/JSX", "Cypress"],
    "code": "https://github.com/alondralezfra/Portfolio"
  },
  {
    "title": "M3ssag1n8 – Real-Time Messaging App with Custom MVC Architecture",
    "description": "Designed a custom MVC architecture using Web Components and strictly typed TypeScript to enable modularity, testability, and low coupling. Implemented real-time messaging with SSE, safe teardown of subscriptions, and concurrency control with AbortController. Added full post-editing functionality via PUT overwrite while preserving data integrity. Enforced JSON Schema validation at API boundaries to prevent malformed data from entering the system.",
    "duration": "Oct 2025 - Dec 2025",
    "tech": ["TypeScript", "HTML/CSS", "Cypress"]
  },
  {
    "title": "OwlDB – Custom NoSQL Document Database and RESTful Service",
    "description": "Developed a production-grade NoSQL database in Go supporting hierarchical JSON storage, authentication, and real-time subscriptions. Implemented a concurrent skip list index with O(log n) operations, achieving 1000+ ops/sec. Built atomic JSON patching and transaction semantics to guarantee all-or-nothing updates. Designed modular architecture emphasizing extensibility, schema validation, and fault tolerance.",
    "duration": "Aug 2025 - Nov 2025",
    "tech": ["Go"]
  },
  {
    "title": "ILOC Compiler",
    "description": "Built a four-stage compiler (scanner, parser, renamer, allocator) for ILOC achieving O(n) performance across multiple instruction classes. Implemented single-pass renaming with next-use analysis and cost-aware register allocation using spill heuristics. Improved scanning performance 3× through O(1) token classification and lightweight data structures.",
    "duration": "Aug 2025 - Dec 2025",
    "tech": ["Java"]
  },
  {
    "title": "Powerpuff – Women’s Community Platform",
    "description": "Developed a full-stack platform for women to share app, product, and travel recommendations. Built recommendation submission workflows and admin approval features. Deployed using MongoDB Atlas and Render with secure environment configuration. Optimized article rendering by caching React state updates, improving load speed by ~40%.",
    "duration": "Jul 2025 - Aug 2025",
    "tech": ["React", "MongoDB", "Node.js", "Express.js", "JavaScript"]
  },
  {
    "title": "AIML Depression Analysis",
    "description": "Built predictive models for depression risk using Random Forest, Logistic Regression, and XGBoost. Performed data cleaning, encoding, SMOTE oversampling, and feature selection. Improved Random Forest accuracy by ~20% through targeted feature selection and identified key predictors including alcohol use, income, and substance abuse.",
    "duration": "Dec 2024 - Mar 2025",
    "tech": ["Python", "NumPy", "Matplotlib", "Scikit-learn"]
  },
  {
    "title": "FEAT – Feedback and Evaluation via Automated Tests",
    "description": "Engineered an automated black-box testing framework that achieved 95% coverage using only 12% of available training programs. Built JUnit and Python integration tests and accelerated execution by 40% via minimal hitting-set reduction. Integrated Python and Java through process I/O for real-time feedback and reporting.",
    "duration": "Sep 2024 - Nov 2024",
    "tech": ["Java", "Python"]
  },
  {
    "title": "VCT Hackathon – Esports Manager Challenge",
    "description": "Built an LLM-powered esports analyst assistant using Amazon Bedrock. Connected multiple esports datasets stored in S3 and automated ingestion through Lambda-based ETL pipelines. Reduced knowledge-base configuration effort by ~20% and improved model performance by ~30% via structured data enrichment.",
    "duration": "Sep 2024 - Oct 2024",
    "tech": ["Python", "boto3", "AWS", "S3", "AWS CLI"]
  },
  {
    "title": "Rotten Tomatoes Movie Review Analysis",
    "description": "Cleaned and processed 15k+ Rotten Tomatoes records, resolving 3k+ duplicates and standardizing critic ratings. Achieved 87% model accuracy using K-Means clustering and evaluation metrics. Analyzed critic-ranking stability and found 20% variance between mean and KNN imputation strategies.",
    "duration": "Sep 2024",
    "tech": ["Python", "Scikit-learn", "NumPy", "Matplotlib"]
  },
  {
    "title": "Active – Social Fitness App",
    "description": "Designed reusable TypeScript UI components and improved navigation efficiency by 10% using Expo Router. Built a bottom-tab navigation system and implemented responsive layouts with Flexbox. Led the design of the Goals screen ensuring consistency across device sizes.",
    "duration": "Jul 2024 - Aug 2024",
    "tech": ["React Native", "Expo Go", "JavaScript", "TypeScript"]
  },
  {
    "title": "Transmission of Bacterial Infection via Directed MST",
    "description": "Computed rooted directed minimum spanning trees on weighted digraphs to model pathogen transmission. Analyzed spread of Klebsiella pneumoniae among 18 patients using genetic distance graphs to infer likely transmission pathways.",
    "duration": "Mar 2024",
    "tech": ["Python"]
  }
]